cf/InformationRegisters/ИсторияРеквизитовЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРеквизитовЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗадач</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/КомментарииЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>КомментарииЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/УчетВремени/Ext/Module.bsl
Функция ПолучитьЗапросаСДатами(ТекстЗапроса, Сотрудник, Проект, ДатаНачала, ДатаОкончания)
	
	// Формирует запрос устанавливает параметры
	
	Запрос = Новый Запрос(СтрЗаменить(ТекстЗапроса, 
		"//+ГДЕ", СтрШаблон("%1 %2 %3", 
		?(ЗначениеЗаполнено(Проект),"			И Задача.Проект = &Проект", ""),
		?(ЗначениеЗаполнено(ДатаНачала),"		И Период >= &ДатаНачала", ""),
		?(ЗначениеЗаполнено(ДатаОкончания),"	И Период <= &ДатаОкончания", ""))));
	
	Запрос.УстановитьПараметр("Сотрудник", 		Сотрудник);
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
	
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьИзмененийРеквизитовЗадачСотруднника(Сотрудник, Проект = Неопределено, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
	
	// Возвращает хронологическую таблицу по изменении реквизитов задач
	//	Задача
	//	Период
	//	Реквизит 				- реквизит над которым производилось действие
	//	Значение				- значение которе было установлено
	
	Возврат ПолучитьЗапросаСДатами("
	|ВЫБРАТЬ 	Задача, Период, ИмяРеквизита Реквизит, Значение
	|ИЗ			РегистрСведений.ИсторияРеквизитовЗадач
	|ГДЕ		Автор = &Сотрудник И ИмяРеквизита <> ""ФактДоп"" //+ГДЕ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 	Задача, Период, ""Описание"", Значение
	|ИЗ			РегистрСведений.ИсторияРеквизитовЗадач
	|ГДЕ		Автор = &Сотрудник //+ГДЕ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 	Задача, Период, ""Комментарий"", ВЫРАЗИТЬ(Комментарий КАК СТРОКА(1000))
	|ИЗ			РегистрСведений.КомментарииЗадач
	|ГДЕ		Автор = &Сотрудник //+ГДЕ
	|
	|УПОРЯДОЧИТЬ ПО Период
	|", Сотрудник, Проект, ДатаНачала, ДатаОкончания).Выполнить().Выгрузить();
	
КонецФункции
Функция ПолучитьТаблицуВремениСотруднника(Сотрудник, Проект = Неопределено, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
	
	// Возвращает когда таймер был включен а когда отключен
	//	Задача
	//	ДатаНачала		- таймер он
	//	ДатаОкончания	- таймер офф
	
	Возврат ПолучитьЗапросаСДатами("
	
	|ВЫБРАТЬ 	Задача, ДОБАВИТЬКДАТЕ(Период, СЕКУНДА, -ВЫРАЗИТЬ(Значение КАК ЧИСЛО)) ДатаНачала, Период ДатаОкончания
	|ИЗ			РегистрСведений.ИсторияРеквизитовЗадач
	|ГДЕ		Автор = &Сотрудник И ИмяРеквизита = ""Факт"" //+ГДЕ
	|
	|УПОРЯДОЧИТЬ ПО ДатаНачала
	|
	|", Сотрудник, Проект, ДатаНачала, ДатаОкончания).Выполнить().Выгрузить();
	
КонецФункции
